Repository: GuiQ-coder/HDD_ProCalc_APP
Catalog: lib/l10n/app_*.arb
Languages: es

# disclaimerText
source: The information, recommendations, links, and all related calculations presented in this application are based on collective experience and knowledge researched from publications in this field and are solely presented and executed in the form of an application for dissemination purposes. However, users must determine how to use the information herein and personally verify the accuracy of their own calculations. This application assumes no responsibility for any damages, errors, or consequences that may result from the use or interpretation of the information provided. Furthermore, it is explicitly stated that no warranty of any kind is offered regarding the accuracy, completeness, or suitability of the information or calculations presented. By using this application, you acknowledge that you have read and understood this disclaimer and fully accept that you are solely responsible for the use you make of it. Access to and use of this application imply the unconditional acceptance of the terms and conditions set forth herein.
es: La información, recomendaciones, enlaces y todos los cálculos presentados en esta aplicación se fundamentan en la experiencia acumulada y el conocimiento derivado de investigaciones en publicaciones especializadas del sector. Esta aplicación se ofrece y se ejecuta únicamente con fines de difusión. No obstante, es responsabilidad exclusiva del usuario determinar la aplicación y el uso que dará a la información aquí contenida, así como verificar de forma independiente la exactitud de sus propios cálculos. Esta aplicación no asume responsabilidad alguna por cualquier daño, error o consecuencia que pudiera resultar del uso o la interpretación de la información proporcionada. Asimismo, se declara explícitamente que no se ofrece ninguna garantía de ningún tipo en relación con la exactitud, integridad o idoneidad de la información o los cálculos presentados. Al utilizar esta aplicación, usted reconoce haber leído y comprendido este descargo de responsabilidad y acepta plenamente ser el único responsable del uso que le dé a la misma. El acceso y la utilización de esta aplicación implican la aceptación incondicional de los términos y condiciones aquí establecidos.

# disclaimerTitle
source: Important Disclaimer
es: Descargo de responsabilidades

# acceptTerms
source: I accept the terms.
es: Acepto los términos.

# continueButton
source: Continue
es: Continuar

source: Driller
es: Perforador

source: Navigator
es: Navegador

source: Fluids
es: Fluidos

source: Settings
es: Opciones

source: All Items
es: Todos los ítems

source: Pipe Weight
es: Peso de Tubo

source: Buoyancy
es: Flotabilidad

# rop
source: ROP (time/pipe)
es: ROP (tiempo/barra)

source: Pipe Handling
es: Manejo de tubería

source: Thread Measurements
es: Medidas de Roscas

source: Manuals
es: Manuales

source: Curve Radius
es: Radio de curvatura

# smysCurve
source: Radius by S.M.Y.S
es: Radio por S.M.Y.S

source: Curve
es: Curva

source: Depth per Pipe
es: Profundidad/tubo

source: Graph per Bar
es: Graficar/barra

source: Hit Target
es: Dar en el blanco

# degreePercentTable
source: Degrees and % Table
es: Tabla ° y %

source: Exit Table
es: Tabla de salida

source: Pipe Curve Table
es: Tabla curva de tubería

source: Tank Volume
es: Volumen Tanque

source: Annular Space
es: Espacio Anular

source: Drilling Additives
es: Aditivos de perforación

source: Required Fluid
es: Fluido necesario

source: Advisors
es: Asesores

# appInfo
source: App Information
es: Información de la app

source: Language
es: Idioma

source: Dark Mode
es: Modo oscuro

source: Language Settings
es: Configuración de idioma

# selectLanguage
source: Select your preferred language
es: Selecciona tu idioma preferido

source: Set Back Rig Calculator
es: Calculadora Set Back Rig

# calculateDistance
source: Calculate Set Back Distance
es: CALCULAR DISTANCIA SET BACK

# angleInDegrees
source: Angle in degrees (6° to 20°)
es: Ángulo en grados (6° a 20°)

# angleInPercentage
source: Angle in % (10.5% to 36.4%)
es: Ángulo en % (10.5% a 36.4%)

# entryDepth
source: Entry depth (meters)
es: Profundidad de entrada (metros)

source: SET BACK DISTANCE
es: DISTANCIA SET BACK RIG

source: meters
es: metros

# distanceInMeters
source: {distance} meters
es: {distance} metros

# angleRangeErrorDegrees
source: Angle must be between 6° and 20°
es: El ángulo debe estar entre 6° y 20°

# angleRangeErrorPercentage
source: Angle must be between 10.5% and 36.4% (equivalent to 6°-20°)
es: El ángulo debe estar entre 10.5% y 36.4% (equivalente a 6°-20°)

source: Technical information
es: Información técnica

source: Angle units:
es: Unidades de ángulo:

source: Percentage (%)
es: Porcentaje (%)

source: Degrees (°)
es: Grados (°)

# calculatorDescription
source: Calculates the minimum required distance between the drill rig and the entry point based on the angle and entry depth.
es: Calcula la distancia mínima requerida entre la perforadora y el punto de entrada basado en el ángulo y la profundidad de entrada.

# technicalInfoPercentage
source: The Set Back Rig is the minimum required distance between the drill rig and the entry point of the pilot hole. This distance depends on the entry angle and depth. Typical angles in HDD: 6°-20° (10.5%-36.4%). Formula used: Set Back = Depth / tan(Angle) Where: - Depth: Vertical distance from surface to entry point - Angle: Entry angle in radians To convert percentage to degrees: Angle(°) = arctan(percentage/100) × (180/π) To convert degrees to percentage: Percentage = tan(Angle in radians) × 100
es: El Set Back Rig es la distancia mínima requerida entre la perforadora y el punto de entrada del pozo piloto. Esta distancia depende del ángulo de entrada y la profundidad. Ángulos típicos en HDD: 6°-20° (10.5%-36.4%). Fórmula utilizada: Set Back = Profundidad / tan(Ángulo) Donde: - Profundidad: Distancia vertical desde la superficie al punto de entrada - Ángulo: Ángulo de entrada en radianes Para convertir porcentaje a grados: Ángulo(°) = arctan(porcentaje/100) × (180/π) Para convertir grados a porcentaje: Porcentaje = tan(Ángulo en radianes) × 100

# technicalInfoDegrees
source: The Set Back Rig is the minimum required distance between the drill rig and the entry point of the pilot hole. This distance depends on the entry angle and depth. Typical angles in HDD: 6°-20° (10.5%-36.4%). Formula used: Set Back = Depth / tan(Angle) Where: - Depth: Vertical distance from surface to entry point - Angle: Entry angle in radians To convert degrees to percentage: Percentage = tan(Angle in radians) × 100 To convert percentage to degrees: Angle(°) = arctan(percentage/100) × (180/π)
es: El Set Back Rig es la distancia mínima requerida entre la perforadora y el punto de entrada del pozo piloto. Esta distancia depende del ángulo de entrada y la profundidad. Ángulos típicos en HDD: 6°-20° (10.5%-36.4%). Fórmula utilizada: Set Back = Profundidad / tan(Ángulo) Donde: - Profundidad: Distancia vertical desde la superficie al punto de entrada - Ángulo: Ángulo de entrada en radianes Para convertir grados a porcentaje: Porcentaje = tan(Ángulo en radianes) × 100 Para convertir porcentaje a grados: Ángulo(°) = arctan(porcentaje/100) × (180/π)

source: Equivalent to
es: Equivalente a

source: Pipe Weight Calculator
es: Calculadora de Peso de Tubo

# pipeWeightDescription
source: Enter the diameter (in inches), thickness (in mm) and length (in meters) to calculate the steel pipe weight.
es: Introduce el diámetro (en pulgadas), el espesor (en mm) y la longitud (en metros) para calcular el peso del tubo de acero.

# outerDiameter
source: Outer diameter (inches)
es: Diámetro exterior (pulgadas)

# pipeThickness
source: Pipe thickness (mm)
es: Espesor del tubo (mm)

# pipeLength
source: Pipe length (m)
es: Longitud del tubo (m)

source: CALCULATE PIPE WEIGHT
es: CALCULAR PESO DEL TUBO

# weightResult
source: Weight: {value} kg
es: Peso: {value} kg

# technicalInfoPipeWeight
source: The weight of a steel pipe is calculated using the following formula: Weight = Cross-sectional Area × Length × Steel Density Where: - Cross-sectional Area = π/4 × (OD² - ID²) - OD: Outer diameter in meters - ID: Inner diameter in meters (OD - 2×thickness) - Length: Pipe length in meters - Steel Density: 7850 kg/m³ Conversions: 1 inch = 25.4 mm 1 mm = 0.001 m
es: El peso de un tubo de acero se calcula mediante la siguiente fórmula: Peso = Área transversal × Longitud × Densidad del acero Donde: - Área transversal = π/4 × (DE² - DI²) - DE: Diámetro exterior en metros - DI: Diámetro interior en metros (DE - 2×espesor) - Longitud: Longitud del tubo en metros - Densidad del acero: 7850 kg/m³ Conversiones: 1 pulgada = 25.4 mm 1 mm = 0.001 m

source: HDPE Pull Strength Calculator
es: Calculadora de Resistencia HDPE

# hdpeDescription
source: Calculates the maximum tensile strength that an HDPE pipe can withstand based on its diameter, wall thickness and material type.
es: Calcula la resistencia máxima a la tracción que puede soportar una tubería HDPE basado en su diámetro, espesor y tipo de material.

# outerDiameterPS
source: Outer Diameter (mm)
es: Diámetro Externo (mm)

# wallThickness
source: Wall Thickness (mm)
es: Espesor de Pared (mm)

source: Material Type
es: Tipo de Material

source: CALCULATE STRENGTH
es: CALCULAR RESISTENCIA

# maxTensileStrength
source: MAXIMUM TENSILE STRENGTH
es: RESISTENCIA MÁXIMA A LA TRACCIÓN

# technicalInfo
source: Technical Information
es: Información Técnica

# purposeTitle
source: What is this calculation for?
es: ¿Para qué sirve este cálculo?

# purposePoints
source: • Determine maximum pullback force in HDD installations • Prevent failures during pipe installation • Select proper pullback equipment • Verify pipe will withstand installation stresses
es: • Determinar la fuerza máxima de jalado (pullback) en instalaciones HDD • Prevenir fallas durante la instalación de tuberías • Seleccionar el equipo adecuado para el pullback • Verificar que la tubería soportará las tensiones de instalación

# formulaTitle
source: Formula used:
es: Fórmula utilizada:

# formulaText
source: Strength (N) = Tensile Stress (MPa) × Cross-sectional Area (mm²) Area = π × (OD - t) × t Where: OD = Outer diameter (mm) t = Wall thickness (mm) π = 3.1416
es: Resistencia (N) = Esfuerzo de Tracción (MPa) × Área Transversal (mm²) Área = π × (DE - e) × e Donde: DE = Diámetro externo (mm) e = Espesor de pared (mm) π = 3.1416

# recommendationsTitle
source: Recommendations:
es: Recomendaciones:

# recommendationsText
source: • Use minimum safety factor 2:1 (strength ≥ 2 × estimated force) • For abrasive soils use 3:1 • PE100 has ≈25% more strength than PE80 • Consider strength reduction for temperature (>20°C) • Always verify manufacturer specifications
es: • Use factor de seguridad mínimo 2:1 (resistencia ≥ 2 × fuerza estimada) • Para suelos abrasivos use 3:1 • PE100 tiene ≈25% más resistencia que PE80 • Considere reducción de resistencia por temperatura (>20°C) • Verifique siempre las especificaciones del fabricante

# exampleDiameter
source: Example: 250 mm for 10" pipe
es: Ejemplo: 250 mm para tubería de 10"

# exampleThickness
source: Example: 14.8 mm for DR11 (PE100)
es: Ejemplo: 14.8 mm para DR11 (PE100)

# invalidValuesError
source: Enter valid values greater than zero
es: Ingrese valores válidos mayores a cero

# thicknessError
source: Thickness cannot be greater than or equal to radius
es: El espesor no puede ser mayor o igual al radio

# buoyancyCalculator
source: Buoyancy and Pullback Force Calculator
es: Calculadora de Flotabilidad y Fuerza de Jalado

source: Pullback Force
es: Fuerza de Jalado

# buoyancyDescription
source: These calculations determine critical forces during HDD pipe installation. Buoyancy reduces the effective pipe weight, while pullback force indicates the tension required for safe installation.
es: Estos cálculos determinan las fuerzas críticas durante la instalación de tuberías HDD. La flotabilidad reduce el peso efectivo del tubo, mientras que la fuerza de jalado indica la tensión requerida para la instalación segura.

# diameter
source: Diameter (mm)
es: Diámetro (mm)

# pipeWeightFlotabilidad
source: Pipe weight (Kg/m)
es: Peso del tubo (Kg/m)

# mudWeight
source: Mud weight (kg/cm³)
es: Peso de lodo (kg/cm³)

source: Typical range:
es: Rango típico:

# equivalentToFlotabilidad
source: (equivalent to 1000 - 1500 kg/m³)
es: (equivalente a 1000 - 1500 kg/m³)

# bentonite
source: • Bentonite: 1.02 - 1.25
es: • Bentonita: 1.02 - 1.25

# polymers
source: • Polymers: 1.0 - 1.1
es: • Polímeros: 1.0 - 1.1

# pureWater
source: • Pure water: 1.0
es: • Agua pura: 1.0

# length
source: Length (meters)
es: Largo (metros)

source: CALCULATE
es: CALCULAR

# buoyancyResult
source: Buoyancy: {value} kg
es: Flotabilidad: {value} kg

# pullbackForceResult
source: Pullback Force: {value} kg
es: Fuerza de Jalado: {value} kg

# makeupTorqueSpecs
source: Makeup Torque Specifications
es: Especificaciones de Torque de Apriete

# dataSource
source: Data extracted from Grant Prideco Drill Pipe Data Tables
es: Datos extraídos de Grant Prideco Drill Pipe Data Tables

# manufacturerNote
source: Remember that specifications may vary by manufacturer, consult your manual.
es: Recuerde que las especificaciones pueden variar según el fabricante, consulte con su manual.

# pipeCalculator
source: Pipe Arrangement Calculator
es: Calculadora de Tuberías

source: Pipe Configuration
es: Configuración de Tuberías

# outerPipeDiameter
source: Outer pipe diameter (mm)
es: Diámetro del tubo exterior (mm)

# smallPipesDiameter
source: Small pipes diameter (mm)
es: Diámetro de los tubos pequeños (mm)

source: RESULTS
es: RESULTADOS

# maxSmallPipes
source: Maximum number of small pipes:
es: Número máximo de tubos pequeños:

# showingFirst150
source: (Showing only first 150 for visualization)
es: (Mostrando solo los primeros 150 para visualización)

source: Ring distribution:
es: Distribución por anillos:

source: Outer pipe area:
es: Área del tubo grande:

source: Single small pipe area:
es: Área de un tubo pequeño:

source: Total small pipes area:
es: Área total de tubos pequeños:

source: Area ratio:
es: Ratio de área:

source: PIPE ARRANGEMENT
es: DISPOSICIÓN DE TUBERÍAS

source: Suboptimal proportion
es: Proporción no óptima

# proportionWarning
source: The diameter of small pipes is less than 5% of the large pipe. Calculation might be inaccurate.
es: El diámetro de los tubos pequeños es menos del 5% del tubo grande. El cálculo podría ser impreciso.

# ropCalculator
source: ROP Calculator - Horizontal Drilling
es: Calculadora ROP - Perf. Horizontal

source: Basic Parameters
es: Parámetros Básicos

source: Advanced Parameters
es: Parámetros Avanzados

# showAdvanced
source: SHOW ADVANCED PARAMETERS
es: MOSTRAR PARÁMETROS AVANZADOS

source: HIDE ADVANCED
es: OCULTAR AVANZADOS

source: BASIC ROP
es: ROP BÁSICO

source: ADVANCED ROP
es: ROP AVANZADO

# majorDiameter
source: Major diameter (mm)
es: Diámetro mayor (mm)

# previousDiameter
source: Previous diameter (mm)
es: Diámetro anterior (mm)

# rodLength
source: Rod length (m)
es: Longitud de barra (m)

# triplexFlow
source: Triplex flow (lts/min)
es: Caudal tríplex (lts/min)

# cleaningFactor
source: Cleaning factor (0-7)
es: Factor de limpieza (0-7)

source: Inclination angle (°)
es: Ángulo de inclinación (°)

# bitWeight
source: Weight on bit (kg)
es: Peso sobre barrena (kg)

# ropResult
source: ROP RESULT: {value} m/h
es: RESULTADO ROP: {value} m/h

source: INVALID DATA
es: DATOS INVÁLIDOS

# verySlowROP
source: VERY SLOW ROP - Check parameters
es: ROP MUY LENTO - Revisar parámetros

# moderateROP
source: MODERATE ROP - Can improve
es: ROP MODERADO - Puede mejorar

# goodROP
source: GOOD ROP - Optimal performance
es: ROP BUENO - Rendimiento óptimo

# excellentROP
source: EXCELLENT ROP - Maximum efficiency
es: ROP EXCELENTE - Máxima eficiencia

# estimatedTime
source: ESTIMATED TIME PER ROD: {value} min/rod
es: TIEMPO ESTIMADO POR BARRA: {value} min/barra

source: TIME NOT CALCULABLE
es: TIEMPO NO CALCULABLE

# excessiveTime
source: EXCESSIVE TIME - Review operation
es: TIEMPO EXCESIVO - Revisar operación

# highTime
source: HIGH TIME - Evaluate improvements
es: TIEMPO ALTO - Evaluar mejoras

# acceptableTime
source: ACCEPTABLE TIME - Good performance
es: TIEMPO ACEPTABLE - Buen rendimiento

# optimalTime
source: OPTIMAL TIME - Maximum efficiency
es: TIEMPO ÓPTIMO - Máxima eficiencia

# rodsPerHour
source: RODS PER HOUR: {value}
es: BARRAS POR HORA: {value}

source: ROP Trend
es: Tendencia del ROP

# calculation
source: Calc. {number}
es: Cálc. {number}

# threadMeasures
source: Thread Measurements
es: Medidas de Roscas

# selectThreadType
source: Select thread type and press 'Show' to view measurements
es: Selecciona el tipo de rosca y presiona 'Mostrar' para ver las medidas

# showMeasures
source: Show Measurements
es: Mostrar Medidas

source: View Thread Gallery
es: Ver Galería de Roscas

# threadMeasuresTitle
source: Thread measurements:
es: Medidas de la rosca:

source: Measure
es: Medida

source: Value
es: Valor

source: Weight
es: Peso

source: Thread Gallery
es: Galería de Roscas

source: Search image
es: Buscar imagen

source: No images found
es: No se encontraron imágenes

source: Image not found
es: Imagen no encontrada

# manualsTitle
source: Machinery Manuals
es: Manuales de Maquinaria

source: Downloaded
es: Descargado

source: Not downloaded
es: No descargado

source: Delete
es: Eliminar

source: Confirm
es: Confirmar

# deleteAllConfirm
source: Delete all downloaded manuals?
es: ¿Eliminar todos los manuales descargados?

source: Cancel
es: Cancelar

source: Delete all
es: Eliminar todos

# allDeleted
source: All manuals deleted
es: Todos los manuales eliminados

source: Manual deleted
es: Manual eliminado

# downloading
source: Downloading {manual}...
es: Descargando {manual}...

source: Please wait
es: Por favor espere

source: Permission required
es: Permiso requerido

# storagePermissionMessage
source: To download manuals, the app needs storage access. Please grant the permission in device settings.
es: Para descargar manuales, la app necesita acceso al almacenamiento. Por favor concede el permiso en la configuración del dispositivo.

source: Open settings
es: Abrir configuración

# fileCorrupt
source: File is corrupt
es: El archivo está corrupto

# radiusOfCurvatureTitle
source: Radius of Curvature
es: Radio de Curvatura

# diameterInput
source: Diameter (inches)
es: Diámetro (pulgadas)

# tubeLengthInput
source: Tube length (meters)
es: Longitud del tubo (metros)

# calculateButton
source: CALCULATE
es: CALCULAR

# resultsTitle
source: RESULTS
es: RESULTADOS

# radiusResult
source: Radius of curvature:
es: Radio de curvatura:

source: Degrees per tube:
es: Grados por tubo:

source: Percentage per bar:
es: Porcentaje por barra:

# errorIconDescription
source: Curvature calculation icon
es: Icono de cálculo de curvatura

# radiusBySMYSTitle
source: Radius by SMYS
es: Radio por SMYS

# yieldLimitInput
source: Yield limit (PSI)
es: Limite de cedencia (PSI)

# fullCurveTitle
source: Complete Curve
es: Curva Completa

# entryAngleInput
source: Entry angle (degrees)
es: Ángulo de entrada (grados)

# barLengthInput
source: Bar length (meters)
es: Longitud de barra (metros)

# radiusInput
source: Radius (meters)
es: Radio (metros)

# requiredDepthInput
source: Required depth (meters)
es: Profundidad requerida (metros)

# resultLabel
source: Result:
es: Resultado:

# depthByDistanceTitle
source: Depth by Distance
es: Profundidad por Distancia

# slopeInput
source: Slope (%)
es: Pendiente (%)

# distanceInput
source: Distance (meters)
es: Distancia (metros)

# depthResult
source: Depth:
es: Profundidad:

# metersUnit
source: meters
es: metros

# hddDiagramDescription
source: HDD depth-distance diagram
es: Diagrama de profundidad-distancia HDD
